In [8]:
import pandas as pd
d=pd.Series(['banana','apple','orange'],index=['a','b','c'])
print(d)

a    banana
b     apple
c    orange
dtype: object

In [3]:
d=pd.date_range(start='05-01-2021',end='05-12-2021')
print(d)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [4]:
d={'rollno':[1,2,3],
  'name':['gouri','anju','varna']
}
var = pd.DataFrame(d)

print(var)

    name  rollno
0  gouri       1
1   anju       2
2  varna       3

In [6]:
list=[['Ram','teacher',27],['Sree','doctor',40],['Anu','engineer',34]]
df=pd.DataFrame(list,columns=['name','job','age'])
print(df)

   name       job  age
0   Ram   teacher   27
1  Sree    doctor   40
2   Anu  engineer   34

In [7]:
df=pd.read_csv("data.csv")
print(df.head())

   no   name  age
0   1   sree   20
1   2  gouri   21
2   3   anju   30

In [15]:
print(df.sort_values(by = ['name']))

    name  rollno
1   anju       2
0  gouri       1
2  varna       3

In [4]:
import pandas as pd
data=pd.read_csv('new.csv')
index={'a','b','c','d','e'}
df=pd.DataFrame(data,index)
df.reset_index(inplace=True)
df

  index  rollno name  age
0     e     NaN  NaN  NaN
1     c     NaN  NaN  NaN
2     a     NaN  NaN  NaN
3     d     NaN  NaN  NaN
4     b     NaN  NaN  NaN

In [23]:
data={'name':['Anu','Sree','Aswin','Arun','Vishnu','Anand'],
     'marks':[23,25,34,28,27,32]}
df=pd.DataFrame(data)
print()
dff=df.head(2)
print(dff)

   marks  name
0     23   Anu
1     25  Sree

In [27]:
data={'name':['Anu','Sree','Aswin','Arun','Vishnu','Anand'],
     'occupation':['engineer','doctor','engineer','teacher','manager','doctor'],
     'salary':[60000,70000,50000,70000,40000,50000]}
df=pd.DataFrame(data)
print(df)
print()
avg=df.groupby('occupation')['salary'].mean()
print(avg)

     name occupation  salary
0     Anu   engineer   60000
1    Sree     doctor   70000
2   Aswin   engineer   50000
3    Arun    teacher   70000
4  Vishnu    manager   40000
5   Anand     doctor   50000

occupation
doctor      60000
engineer    55000
manager     40000
teacher     70000
Name: salary, dtype: int64

In [29]:
import numpy as np
df=pd.DataFrame({'values':[700,np.nan,500,np.nan]})
print(df)
print()
df=df.fillna(0)
print(df)

   values
0   700.0
1     NaN
2   500.0
3     NaN

   values
0   700.0
1     0.0
2   500.0
3     0.0

In [38]:
import pandas as pd
data=pd.read_csv('cname.csv')
print()
data['profit']=data['profit'].apply(lambda x:x>0)
print(data)

  cname  profit
0   ABG    True
1   JPK   False
2   BBG    True
3   RCC   False
4   MNE    True

In [2]:
import pandas as pd
data=pd.read_csv('eid.csv')
print()
data2=pd.read_csv('c.csv')
print()
df=pd.merge(data,data2,how='inner',on='eid')
print(df)

   eid  position  ename  stipend
0    1  employee  gouri     2000
1    2    intern   anju     4000
2    3  employee  varna     1500
3    4    intern  anchu     3000